-- Add migration script here
-- Your SQL goes here
INSERT INTO posts ("content", "created_at", "updated_at", "user_id", "reply_to") VALUES
('Content of post 1', CURRENT_TIMESTAMP, CURRENT_TIMESTAMP, 2, NULL),
('三个数字入门：1-2-6
1：所有的茶都来源于同样一种茶树。不同的茶类来自不同的茶树这是误解，并没有绿茶树和红茶树的区别。
2：在山茶科山茶属茶组的近 20茶类植物中，通常只有茶种（俗称“小叶种”，因为耐寒，种植面积广泛）和阿萨姆种（俗称“大叶种”，原始品种，只分布在偏热地区）两个品种。
6：六大茶类：绿茶、白茶、黄茶、青茶、红茶、黑茶。

一颗茶树的鲜叶可以制成任何一种茶，不同茶叶的颜色和口味是由不同工艺产生。制茶讲究看茶制茶，就是根据想要的品质特征来选取相应的茶，并不是越稀缺越好、越嫩越好。一杯茶的风味由品种、风土、工艺、冲泡来决定，不需要乱七八糟的故弄玄虚的法事。

中国茶命名规则：
地名+茶：如六堡茶、龙井茶、普洱茶；
名称+外形：如黄山毛峰、君山银针；
地名+品类；如滇红、福鼎白茶；
茶树栽培品种直接命名：如大红袍、鸭屎香；
特殊：如安吉白茶（实际是绿茶，因为研制品种是白化品种，故称白茶）。

六大品类：1979年，茶学家陈椽正式提出。将茶分六大类。区分依据：干茶颜色、品质和制法的系统性。六大茶类分法 2023 年从中国的分类体系上升为 ISO 世界标准。

如同不少常识一样，是因为一些人的懒惰和另一些人的别有用心而造成了信息差。由此推荐下 YouTube 上一席的这期分享，可以简单明了地了解基本茶学知识。上述总结正是来源于此：

https://youtu.be/bvKp7KoCPWU?si=KD98_Gr48kpz8tiE', CURRENT_TIMESTAMP, CURRENT_TIMESTAMP, 2, NULL),
('男生只需布局三年，就没人敢瞧不起你

一、每天布局

1、每天坚持早睡早起。坚持6:00起床，22:30分左右睡觉。坚持每天唤醒你的不是闹钟，而是梦想。

2、每天坚持看书二小时，没有时间也要挤出时间去看，随身携带一本书、坐公交、地铁的时候也可以看几页。

读书，要多读一流的好书，站在巨人的肩膀上去看世界。

3、每天日程坚持守时。凡事提前10分钟，重要会议提前二十分钟。写好当日计划，知行合一。

4、每天坚持运动，顶置健康能力。
每天摄入8粒红枣10粒枸杞，再来2~3公里慢跑或快走，保持身体活力四射。

5、每天坚持出门前，面对镜子微笑。头发要姿整，皮鞋要油亮，腰杠要挺直，胡子不要走中间路线，人要有精神气。每天走路，走的是虎步。

二、每周布局

1、每周去一次图书馆，博览群书，提高思想和技能，最充分地去适应时代。

2、每星期去见一个你想见的人，可以请比你优秀的人单独吃饭，也可以和志趣相投的人在一起，提升能量。

3、每星期登山一次，会当凌绝顶，一览众山小。登山感悟自然，与生命对话，与命运和解

4、每周花半天时间，写一篇有深度的文章;或观看一部一流的记录片，再写一篇读后感。保持思想输出。

5、每周和父母见一次面，家人闲坐，灯火可亲，就是握着一份稳稳的幸福。

如果路途遥远，那么至少每星期给父母打一次电话，维持亲情，靠近亲情，因为人到了一定的年纪后，你就会发现，除了家人，你已几乎一无所有。

三、每月布局

1、每月存一次钱，哪怕是少少的3000~5000元，也要坚持每月固定存钱，顶置储蓄能力。
银行卡里的余额，才是你生活的底气。

2、每月去做一件“无用”但开心的事。如到陌生的地方旅行，或参加马拉松比赛，“无用”即大用。

3、每月考察调研一次，研究趋势，捕捉机会，发现商机。

4、每月做一次义工，向他人付出爱，积福积徳。做人施比受有福。

5、每月断舍离一次。不需要的东西，扔掉;负能量的朋友，扔掉。

四，每年布局

1、每年做一次战略布局。选择比努力重要，不要用战术上的勤奋去掩饰战略上的懒惰。

2、每年自己体检一次，带家人体检一次。关注健康，听从营养医生的建议，调整生活方式和饮食习惯，养成更好更合适的生活规律。

3、学会藏富。每年做一次稳健的投资，让财富产生裂变，增加睡后收入。

4、每年出国一次，去感受不同的文化，去见识世界不同的面。

5、每年回老家一次，寻根祭祖，饮水思源，回到故土，审视自己的灵魂，注入生命新的能力，不忘初心，重新出发。', CURRENT_TIMESTAMP, CURRENT_TIMESTAMP, 3, NULL),
('偷偷告诉你一些，“人性潜规则”

1.别人发来信息，不要秒回，秒回会显得无所事事。

2.在别人家，如果他的另一半，躲在房间里不出来，说明不欢迎你，找个理由，赶紧走。

3.去亲戚家里，尽量选择住宾馆，你换位思考一下就知道。

4.红事不请不去，白事不请自来。

5.微信里给你发“在嘛”，一般是有事求你，不是借钱，就是有棘手的事。

6.别人让你看他的手机时，不要乱点、乱滑动，每个人都有自己的秘密不想被你发现。

7.带“吧”字的话一定要反着听，比如:“留下来一起吃饭吧”，这时候就要找理由离开了。

8.亲戚开的店，可以少去，但不能一次都不去。

9.刚刚参加过白事，就不要去别人家串门，别人会嫌弃。

10.去朋友家做客，再好的朋友，也要带点礼物，哪怕是几斤水果，因为你不带礼物，朋友不会介意，但他家人会介意。

11.朋友亲戚家孩子再不对，自己也不去教育，因为教育别人家的孩子，就是在打别人的脸。

12.男人出差回家，最好提前打个电话给老婆。

13.不谈论不在场的人，你说出多少秘密，就有多少危险，在等着你。

14.去外地出差，不要联系本地的同学，要理解大家都很忙，你联系了，别人就得招待你。

15.一个人去异性同事的办公室，记得把门打开。

16.去亲戚朋友家做客，回到家以后记得报一个平安。

17.别人倒茶给你喝时，就算不渴也要喝一点，这叫尊重。

18.份子钱一定要重视，份子钱的多少直接决定朋友的感情深浅。

19.喝了酒，不要送异性回家。

20.坐朋友的车，下车后，关门尽量轻一点，不然你会被朋友莫名的讨厌。

21.别人请客，不带朋友，客不带客是规矩。

22.出门聚会时，记得提前10分钟到，宁愿等的久，不要别人等，久而久之你就会被信任。

23.求人办事，带上一个大家都熟悉的朋友，这样成功率会很高。

24.长期招工的公司，千万不要去，待遇一定不怎么样。

25.出去出吃饭时，人家夹菜不要转桌，看到人家敬酒，要懂得放下筷子。

26.半路遇到的酒局，别人再热情也不要去。

27.人老了，不要跟孩子走的太近，各过各的日子，可以避免很多矛盾。

28.晚上8点以后尽量不打电话给别人，有事就发微信。

29.别人夫妻吵架找到你，你就算觉得别人再不合适，也要劝和不劝分，因为别人一旦和好，你就是被远离的那一个人。

30.叫别人买东西，一定要先给钱，多退少补。

31.同居越久，越难结婚。

32.不管你信不信，女人醉酒，抽烟，纹身，都会被别人看轻。

33.女人只要经济不独立，在家庭中做的再好，也会被男人嫌弃。

34.如果你不想和某人聊天，但又不想得罪他，就把回信息的时间拉长。

35.对待亲戚，少装富，多哭穷；对待朋友
害人之心不可有，防人之心不可无。

36.劝你大度的人，大多没安好心。

37.教你赚钱的人，多数都是想赚你钱。

38.别人来和你说公道话，就已经说明他不站在你的立场来说话。

39.免费的产品，最后都是想把你变成产品。

40.不要指望别人，会为自己雪中送炭，没有人在你脸上抹炭，就要谢天谢地了。', CURRENT_TIMESTAMP, CURRENT_TIMESTAMP, 4, NULL),
('运动+早睡+戒糖+防晒+多喝水，你就比90%的人美了
2、糖是万恶之源，比辣还可怕，糖化和光老化是皮肤衰老的两大元凶
3、一年四季都要防晒，抗衰老就是从防晒开始的
4、多运动可以提高新陈代谢，帮助肌肤排毒
5、每天保证充足睡眠，比任何护肤品和保健品都管用
6、保持好心情，避免肝火旺盛造成内分泌失调，多喝水，可以促进新陈代谢
8、不要侧睡，不仅会压迫身体器官，还会加重皱纹和法令纹
9、不要用手挤痘痘，有感染的风险，还容易留下痘印
10、定期清洗化妆工具，避免细菌的产生', CURRENT_TIMESTAMP, CURRENT_TIMESTAMP, 2, NULL),
('我从小在江南的茶园长大，家乡只产一种绿茶，从摘菜杀青揉制到烘干都是茶农们一手包办。每年茶季从谷雨前摘取“一针一叶”一直延续到四月底，越小的茶越卖相好市场价值高所以茶农家里都是喝季尾采的有数片大叶的“壶茶”。我记忆中家里一直有一直烧水壶那么大的陶壶，每天早上外公起床以后除了洒扫就是泡“壶茶”，一壶茶可以一直兑水喝一天到最后都有茶味。通过这个视频我才明白原来茶叶的大小和采摘时间不同也是风味各异的原因。

茶对于我是一种精神寄托。从前听大人说茶树喜阴，我老家的茶山通常与竹林相毗邻。早春的时候天气放晴和家人上山采茶，上山一路上有杜鹃花紫藤，鸟语花香。茶山氤氲缭绕，山风吹过茶叶青竹的清香混合湿润着清晨的空气扑鼻而来。。。风带动银浪般的竹叶发出沙沙的声响都是童年美好回忆的一部分。

出国20年了，很少喝绿茶，即便收到家人从国内寄过来的家乡茶叶也品不出当年“壶茶”那个味道。“儿时之乐，斯乐不可作”。。。', CURRENT_TIMESTAMP, CURRENT_TIMESTAMP, 3, NULL),
('我爱喝茶也喜欢咖啡。发现两者不同之处则是咖啡追求的是一刹那的芳华，而茶则是一整个过程。一杯我们一勺的咖啡粉只能萃取一杯咖啡，所以那一杯咖啡的口味非常重要。但是茶有个过程，你可以喝刚泡开的淡茶，然后喝第二次的香茶，可以泡久一点喝浓茶，再继续泡下去，每一杯都会不一样，但终究从清水而起，回到清水而结束。宛如喝了人的一生。很多时候，我会更倾向于喝茶因为它让我感受到此时此刻只是人生的一部分，它不光是能让我感觉清醒，也让我感觉安定。任何事加上时间，会呈现出不同的结果，但它一定都在变化。而每一刻都有它存在的意义和规律，值得细细品味。', CURRENT_TIMESTAMP, CURRENT_TIMESTAMP, 2, NULL),
('你焦虑是因为你有完成这件事的实力，许多事情看起来希望渺茫，但请相信，人生永远贵在坚持，成在勤勉，我们所要做的是坚持初心，做好眼下该做的事，相信自己，简单点努力点，乐观点豁达点，惊喜就会多一点，你不能为目标太难而消沉，你要走别人走不到的路，熬别人受不了的苦，这样才能达到别人到不了的终点，渔夫出海前，并不知道鱼在哪儿，但还是出海，是因为相信会满载而归，很多时候，是因为选择了才有机会，相信了才有可能，每天的努力学习，不是为了感动谁，也不是为了证明给谁看，而是我知道，一路奔跑远比原地踏步好得多，你的青春，再多弯路也只能自己走，只有穿过那片迷雾，才能真正的勇敢，关于你的未来，只有你自己才知道，想要的东西只能自己去争取，冲破牢笼这件事情，只有你自己能做。让我们成为哪种人的，不是我们的能力，而是我们的选择，没人逼着你每天背单词背到头痛，背到天亮，没有人逼着你为了一张申请表，跑东跑西的，没有人逼着你离开，去一个陌生的地方，可是你还是义无反顾地去了，因为我们不甘心，我们想要多姿多彩的生活，在人的一生中，我们会遇到很多很多的困难，我们会迷茫，我们会焦躁，但我们绝对不能迷失自我，坚定心中的理想信仰，成为自己的主人。我们没有必要同别人进行跟风，而是应该根据自己的进度自己的能力，自己的计划去做属于自己的事情，这样我们才能成为更好的自己，我们生来平凡，但可以活得伟大，相信自己可以实现自己心中的理想信仰。', CURRENT_TIMESTAMP, CURRENT_TIMESTAMP, 4, NULL),
('有些人的一生注定是被奴役的，这是任何人都无法改变的事实。

我并没有傲慢的想要去拯救谁，我也很清楚，我改变不了任何人。

能改变的人或早或晚都会改变，我写的东西对他来说只能起到一个稍微加速的作用，少走点弯路。

教育的核心并不是培养，而是筛选。

那些无法被改变的人，命运几乎是被注定的。

只是每次看到这样的人，都会有种生理不适。

那种感觉就像在路边，看到一群人撕扯另一个人的身体，吞下他的肉。

每次遇到这种时刻，我都会产生某种莫名的悲哀与无力感。

我不明白为什么生理构造相同的人类，被如此惨烈的剥削，他还是像个动物一样无法察觉，甚至乐在其中。

我不明白，为什么这种比恐怖片还要恐怖的事情，无时无刻的上演，人们身处其中却能轻松的生活。

我每天都在努力的挣扎，避免自己成为他人的盘中餐，小心翼翼的避免犯错，避免自己走到万劫不复的境地。

但看着那么多人类，欢快的奔向为他们定制的屠宰场却什么都没有察觉。

生存是一个多么残酷的话题，你每天可以在任何地方看到为生存奔波的人类，在贫穷、愚昧中痛苦挣扎的人类。

每天都有无数悲剧在上演，有无数惨不忍睹的事情发生。

可即使如此，大家还是不愿意去学习，去训练自己，让自己变强，让自己看清这个世界真实的样子，努力的照顾好自己，努力的照顾好家人。

无论我说过多少遍，他们还是无动于衷。

我知道这是很多人注定的命运。

可我总是没办法眼睁睁的看着这些人陷入深渊。

我不想看到他们在我面前被绞成各种形状。

或许我才是精神不正常的那一个吧。', CURRENT_TIMESTAMP, CURRENT_TIMESTAMP, 2, NULL),
('我觉得我男朋友（以下简称他为小鱼）这个人特别云淡风轻，也不咋爱说好听的话，平常也总吵吵，他总是犯贱把我气哭，然后再犯贱把我逗到破涕为笑（我这个人的性格会觉得这样很生气但是我只能说：我笑不代表我开心！[拳头]）。我的情绪比他更外放也看起来更充沛一点，偶尔会逼问他有没有好听的情话说给我，平时能说会道的他嘴巴会此时突然变笨。我有时候很片面地觉得在他生活里，感情比重占的就没那么大。
今天小别一下，机场里他塞我一封手写信。信的结尾写：
“在遇到你之前我总相信没有什么值得好吵的，但相处又让我明白生活总有它的运行方式，你让我明白了生活，这也就意味着我对于生活的理解里必然包含有你的想法。你能意识到这是一件多么重要的事吗？这意味着我的思想里将永远有一个你的意念与我共存。你就成为了我身体里的一部分。这是最好的情话，你说是吗？”
我从来觉得不管两个人是否会一直爱下去，但在所有感受到爱而为之动容的时候，对我来说爱都显得尤为伟大！[单身狗]', CURRENT_TIMESTAMP, CURRENT_TIMESTAMP, 4, NULL),
('“20 岁的时候没法说
我未来 30 年只做
这一件事。
世界上还有
那么多事情没尝试过，万一找到
更喜欢的呢？”', CURRENT_TIMESTAMP, CURRENT_TIMESTAMP, 4, NULL),
('你太急切的想要一个答案了。想要风光的学位，瞬间的博学，想要意气风发，想闪着金光走向喜欢的人。但现实告诉我，操之过急便会败北，她要我等，要我耐得住不断延长的时间线，要我交付出足够的努力堆砌在沉闷、晦涩的时光里，才肯将一切“我想要”一点一点递送至我手里。我知道你最近很累，是那种看不见的，身体上和精神上的疲惫感，但是请你一定要坚持下去。就算无人问津也好，技不如人也罢，千万别让烦恼和焦虑毁了你本就不多的热情和定力。不管怎样，今天六一儿童节，请务必休息一天。

今天是408日，图灵说把这条消息转给10个人就可以考研408涨20分，我试了是假的，但今天是408日，群友得休息一下

还有269 天了，我还是那句话，大家能放弃就放弃，人生辉煌，各自精彩，不应该在这里挥霍，仔细想想你多久没陪爸爸妈妈好好的聊聊天了，多久没有听男朋友，没有听女朋友说心里话了，什么没有男朋友没有女朋友，我都不好意思说你，研究生啥时候都能考，对象看不住就只能当给别人养的了，所以大家一定要看清真相，不要被功利蒙蔽了双眼，早点退出，实现人生的价值！

现在说什么都没用，也没人会信，明天就知道了，及没及格，对鼠鼠来说只是一种结果了。鼠鼠好想回下水道，那里才是鼠鼠的家，鼠鼠不想内卷不想内耗，鼠鼠不用每天晚上睡不着，不用每天喝完酒睡觉，不用面对内耗一年结果一场面试一无所有。鼠鼠好想随随便便地活着。

起了兄弟们，不能起太晚，因为咱这里面有科班的，还有跨考的,其中不少还是985的大佬，你们好好的，初试考高点。还是那句话，给自己的父母争点光，别跟我学，24考研，三月还在求极限，现在深感来不及了，每天都以泪洗脸，后悔也没有用了，时间不等人，害，没出息，真事,让人唠一辈子。说句实话，我现在都成为笑话了，我不能让人笑话一辈子

我起床了，这个点起床的人，是未来之星，国家栋梁，是成语里面的学富五车，才高八斗，是都市小说里的城市之光，是俗语里的天秀之人，是粤语里的巴鸠撚闭，是武侠小说里的人中龙，是吾日三省吾身的自律者，是相亲节目里面的心动嘉宾，是自然界的丛林之王，是世间所有丑与恶的睡弃者，是世间所有美与好的创造者，一想到我与这群优秀的人呼吸同一股空气，我就忍不佳骄傲与自豪。

五一反正我是休息五天，毕竟后面打的都是身体战，如果现在不好好休息，后面绝对是撑不住的，而且考研官方从来都没有要求我们去复习，只是说了考试范围，报名时间，勘察现场，进行考试，从来就没有复习环节，所以的内容都是我们本科学过的，那些复习的都是本科没有好好学，现在想投机取巧，反正我是不太打算复习的，我是一直休息，考试的时候你什么都不用带，监考老师看你什么都没有会给你一只笔的，不管大家怎么样，反正我五一是务必休息五天

国庆节了，别再讨论什么敛散性、中值定理、多元函数的最值问题了。你带你的高数课本回到家并不能给你带来任何实质性作用，朋友们兜里掏出一大把钱吃喝玩乐，你默默的在家里刷着你的18讲，还是不会。亲戚朋友吃饭问你收获了什么，你说我熬夜卷了一份李林4，亲戚们懵逼了，你还在心里默默嘲笑他们，笑他们不懂一个P把两个矩阵对角化，笑他们只会配方法都配不齐。你父母的同事都在说自己的子女一年的收获，儿子买了个房，女儿买了个车，姑娘升职加薪了，你的父母默默无言，说我的儿子买了一本肖4，天天在家神神叨叨，房间乱七八糟，女朋友也没一个 

有人问我，考研不复习可以吗，我笑了，考研招生流程为:九月预报名，十月报名确认，十一月现场确认拍照片，十二月下旬考试。在所有流程中，均没有提到要求考生复习。考研所考科目均是大学本科专业课和公共基础课，如果不是跨考都学过。考研复习的往往都是那些平时不好好学习，又对自己的计算推理能力没信心的人，妄图借助复习提高自己的分数水平,是一种畸形的应试心理。研究生招生考试是对研究型人才的选拔性考试，提前复习死记硬背违背其考试的初衷。综上，我认为根本没有必要复习，兄弟们，考试记得带身份证就行，大多数考场老师看到你没带笔都会帮你借一支的。', CURRENT_TIMESTAMP, CURRENT_TIMESTAMP, 4, NULL),
('渡有心人，送给年轻人！
人生最有价值的知识主次及比例
①预防人生意外事故、研究透彻各种不良习气危害并避之，学会休息，预防运动损伤，健体使身体稳固不易损伤的知识（60％）；
②上好学，培养傍身技能，记住稀缺是精髓，社会正常运行必要的职业，生活刚需手艺活，专研透了，也能养你一辈子（30％）；
③怎么教育子女，做好社会角色分工（8％）；
④艺术素养 乐器、绘画、舞蹈等（2％）。
健康活着，持续健康活着，持续幸福健康活着。起步的迟没关系，只要跑的越久，就跑的越远。
清醒的头脑，健全的四肢，充实的肠胃，是每天要核查和保持的。
保持健康，生活便进可攻，退可守。
警惕贪（对于喜好的过于偏执）、嗔（对于讨厌的反应过激）、痴（对不明事理表现贪与嗔的反应），一旦发作，让人失去驾驭人生大局的基本理智。
凡事三思:思危、思退、思变。
这个社会需要有真实能力的人去做事
这个世界健康其实才是最稀缺的东西
其他:
充分准备，克制墨菲定律。
①最好一辈子不沾酒，醉酒、喝酒不爬高，醉了一定要找低矮床铺侧卧休息。
②膝关节是人体最复杂的关节，一定不要损伤，因为最复杂，一旦损伤，修复也是最难的。保护膝盖知识。
③健身体成习惯，心平静，充分热身，量力而行，场地光线充足安全无障碍。
④我们成长中，各种原因原生环境，思想上行为上或多或少都背负着那么一些歪理邪说成分，长大了，要懂得筛查找出，不然它就好比一颗雷，谁知道那天触发了它就炸了。
⑤终生要思考追求的话题:这个世界的真实面貌是什么样的，事实是什么；生存能力中判断力高于一切，只有真实客观的判断才能做出正确的选择，什么是好。
⑥远离极度自私垃圾人，远离以权力背景压人的人，若不可避免，至少与他们相处时，一定要思危，嗅到不对时，及时跑路，退到安全的地方，以逸待劳，思考应对。
⑦身材管理，体重/身高平方≤23kg/m²
推荐
叔本华的《人生的智慧》，梁应林《人生意外800鉴》，杨渝平《运动损伤那些事》 ，北泽杏子《讨厌!喝酒好可怕》 
预防的疾病
    病毒肝炎（疫苗）、艾滋病（洁身）、肺结核（健身营养）、膝关节半月板撕裂（软骨损伤不可再生）、椎间盘突出、老人股骨头骨折（老人死亡骨折）尘肺（呼衰），脊髓损伤、脑梗偏瘫（生活不能自理），狂犬病（高死亡率）。
出门看天气防雷电溺水、高空坠物、车祸、踩空、滑倒。
健康是为了生命充分绽放。
早意识到这些，生活中主动避免。', CURRENT_TIMESTAMP, CURRENT_TIMESTAMP, 4, NULL),
('二十多岁了，不要再讨论什么ios，flyme, color oS, miui, 类原生了。
你摆弄一堆破刷机包在家并不能给你带来任何实质性作用，朋友们兜里掏出一大把钱跟对象吃喝玩乐，你默默的在家里摆弄着你的红米手机。亲戚朋友吃饭问你收获了什么，你说我刷上了miui精简包，亲戚们都懵了，你还在心里默默嘲笑他们，笑他们不懂你的一天一充电，不懂你的手机运行快，笑他们扫码都开半天一用就发烫，也笑他们手机系统广告满天飞关都关不掉。你父母的同事都在说自己的子女一年的收获几百万，儿子买了个房，女儿买了个车，孩子娶媳妇成家了，明年要当爷爷奶奶了，你的父母默默无言，说我的儿子电脑下了一堆资料，数据线天天连接着电脑，手机黑了亮亮了又黑了一晚上，在床上又哭又笑....', CURRENT_TIMESTAMP, CURRENT_TIMESTAMP, 4, NULL),
('上周末抽空在家看完了这部电影《白日梦想家》
直到今天电影里的情节还不停地在我脑子里重现。

这是一部有温度、有情怀、有深意的好片，它没有一点商业化，也没有刻意讨好任何受众人群，但看完此片的人就是能被情节深深地触动，我甚至觉得这份触动里一大半会是男性观影者。

豪不夸张地说，这部电影它其实就是一碗浓而不腻，却又令人回味无穷的鸡汤，在男主的带领之下你能深切的体会到那个叫做勇气和热血的东西，其实是不会因为人到中年而死去的，只要你有信念和爱它就还能在你体内聚集出洪荒之力。

你也能通过环环相扣的每个场景、每段音乐，深切地感受到一种发自内心深处被点燃激情一般地狂热，无论是因为遇见了心动的女人，还是为了一份别人眼里平凡而普通，可你却热爱又坚定的事业。

片里我印象深刻的几个场景，也是男主开始改变的地方，他做了很多只是自己曾经白日梦里想要做的事，比如跳入冰岛的冰海、和鲨鱼搏斗、坐了醉汉开的直升机、攀登喜马拉雅山，这些看似离奇的经历像是一场白日梦，但其实也是他另一半的自己，最终他回归了生活，只是这次拥有了勇气也知道了生活的真谛。

因为窘迫卖掉了父亲留给母亲的古典钢琴，回到了母亲和姐姐身边，用最帅气的方式回击了一直欺压他的领导，也勇敢地对心目中的女神说出了爱意牵起了她的手，他终于不再做白日梦，而开始真正的生活了。他想要活一场不遗憾的人生。

很多人都过不好自己的一生，有时候其实只是因为我们还没真正的去用心思考过。自己到底想要一场怎么样的人生，生活从来不是糖分的甜，它本来就是无数的琐碎和变量的融合体。所以，要活的真实就要接受无数的残缺和无奈，旁人的热闹与我无关，跨过自己人生的坎，勇敢地生活，好好珍惜，不留遗憾，不枉此生。', CURRENT_TIMESTAMP, CURRENT_TIMESTAMP, 4, NULL),
('前两天还在和我男朋友吐槽抱怨，感觉好多人都缺乏基本逻辑思考能力对因果关系的判断力很弱，导致我要给他们讲明白一件事情要把整条逻辑链挖出来放在他面前去给他解释，感觉耗费了额外的精力。然后他的回复宛若醍醐灌顶……
他说：“人和人之间思维能力的差距就是可以很大的，听说智商相差30以上就会难以沟通。你如果在沟通中感到厌烦那说明你其实不愿意和他沟通。”', CURRENT_TIMESTAMP, CURRENT_TIMESTAMP, 4, NULL),
('刘勖雯书单
1《爱弥儿（精选本）》【卢梭】
2《K.K三部曲必然》【凯文凯利】
3《KK三部曲科技想要什么》【凯文凯利】
4《K.K三部曲失控》【凯文凯利】
5《阿奎那政治著作选（汉译名著本》【马清槐】
6《保守主义思想:从伯克到艾略特》【拉塞尔柯克】
7《辩论:美国制宪会议记录》【詹姆斯·麦迪逊】
8《伯罗奔尼撒战争史（全新详注修订本，精装全2册）》【修昔底德】
9《伯罗奔尼撒战争史（全新详注修订本，精装全2册）》【修昔底德】
10《存在与时间》【马丁海德格尔】
11《大学中庸译注》【王文锦】
12《道德情操论（西方学术经典·精装版）》【亚当斯密】
13《第二性1》【西蒙娜德波伏瓦】
14《第二性Ⅱ》【西蒙娜德波伏】
15《第一推动丛书生命系列:脑中魅影》【vs.拉马钱德兰S布莱克斯利】
16《第一推动丛书宇宙系列黑洞与时间弯曲》【基普S.索恩】
17《第一推动丛书宇宙系列时空本性》【史蒂芬霍金罗杰彭罗斯】
18《第一推动丛书宇宙系列死亡黑洞【尼尔德格拉斯泰森】
19《第一推动丛书综合系列:数学的意义》【约翰查尔顿波金霍尔】
20《浮士德上》【浮士德】
21《浮士德下》【浮士德】
22《管理行为（珍藏版）》【赫伯特西蒙】
23《国富论（1-3卷）》【亚当斯密】
24《国富论（4-6卷）》【亚当斯密】
25《国富论·人类活动中的理性》【赫伯特西蒙】
26《哈耶克作品集:通往奴役之路》【弗里德里希·奥古斯特冯哈耶克】
27《哈耶克作品集:自由宪章》【弗里德里希·奥古斯特·冯哈耶克】
28《哈耶克作品集:致命的自负》【弗里德里希·奥古斯特冯哈耶克】
29《货币的非国家化》【弗里德里希冯哈耶克】
30《见识城邦吾国教育病理》【郑也夫】
31《经济学原理》【张维迎】
32《精神现象学上》【黑格尔】
33《精神现象学下》【黑格尔】
34《旧制度与大革命》【托克维尔】
35《菊与刀》【鲁思本尼迪克特】
36《君主论-（拿破仑批注版）》【马基雅维利】
37《狂热分子（精）》【埃里克霍弗】
38《老子今注今译》【陈鼓应】
39《理想国》【柏拉图】
B502232
40《理想国译丛奥斯维辛:一部历史（NO:017）》【劳伦斯·里斯】
41《理想国译丛战争、枪炮与选票（N:022）》【保罗利尔】
42《历史的拐点:中国历朝改革变法实录》【马立诚】
43《利维坦:论人类和国家（全英文原版）》【托马斯·霍布斯】
44《联邦党人文集》【亚历山大汉密尔顿/詹姆斯麦迪逊/约翰杰伊】
45《联邦论:美国宪法述评（精装）》【亚历山大汉密尔顿詹姆斯麦迪逊/约翰杰伊】
46《林中路（精装）》【海德格尔】
47《论犯罪与刑罚》【切萨雷贝卡里亚】
48《论历史》【塔里克阿里】
49《论语译注（简体精装本）》【杨伯峻】
50《美丽新世界（译文名著精选）》【奥尔德斯·赫胥黎】
51《孟子译注（简体字本）》【杨伯峻】
52《民主与大坝:美国田纳西河流域管理局实录》【大卫利连索尔】
53《尼采三书（悲剧的诞生）》【尼采】
B516.47/44-2
54《尼采三书（查拉图斯特拉如是说）》【尼采】
55《尼采三书（权利意志）》【尼采】
56《启蒙运动三书论法的精神上》【孟德斯鸠】
57《启蒙运动三书论法的精神下》【孟德斯鸠】
58《启蒙运动三书社会契约论》【卢梭】
59《启蒙运动三书哲学书简》【伏尔泰】
60《钱穆作品精选:中国历代政治得失（精装版）》【钱穆】
61《枪炮、病菌与钢铁-人类社会的命运（修订版）》【贾雷德戴蒙德】
62《人类简史三部曲:今日简史》【尤瓦尔赫拉利】
63《人类简史三部曲:人类简史》【尤瓦尔赫拉利】
64《人类简史三部曲:未来简史》【尤瓦尔赫拉利】
65《人文与社会译丛:现代性与大屠杀》【齐格蒙鲍曼】
66《人文与社会译丛:驯化君主》【哈维·C曼斯菲尔德/冯克利】
67《人文与社会译丛:自由论（修订版）》【以赛亚柏林】
68《人性论（精装）》【休谟】
69《如何阅读一本书》【莫提默小艾德勒/查尔斯·范多伦】
70《上帝之城（上）（修订版）》【奥古斯丁】
71《上帝之城（下）（修订版）》【奥古斯丁】
72《社会主义-经济学与社会学的分析》【路德维希冯米塞斯】
73《神曲（译文名著精选）》【但丁】
74《市场与政府:中国改革的核心博弈》【张维迎】
75《通胀螺旋:中国货币经济全面崩溃的十年1939-1949）》【张嘉玖】
76《万历十五年（增补本）》【黄仁宇】
77《韦伯政治著作选》【马克思韦伯】
78《文化与帝国主义（二版）》【爱德华w萨义德】
79《文明的冲突与世界秩序的重建（修订新版）》【塞缪尔享廷顿】
80《文学回忆录（上）》【木心讲述，陈丹青笔录】
81《文学回忆录（下）》【木心讲述，陈丹青笔录】
82《我们》扎米亚金83《乌合之众:大众心理研究》【古斯塔夫·勒庞】
84《乡土中国（精装）》【费孝通】
85《想象的共同体--民族主义的起源与散布（增订版）》【本尼迪克特·安德森】
86《新教伦理与资本主义精神》马克斯·韦伯
87《胭脂与焉支郑张尚芳博客选》【郑张尚芳】
88《耶路撒冷三千年》【西蒙蒙蒂菲奥里】
89《一九八四》【乔治·奥威尔】
90《哲学研究》【维特根斯坦】
91《正义论（修订版）》【约翰罗尔斯】
92《政府论（全英文原版）》【约翰洛克】
93《政治学（亚里士多德著作单行本）》【亚里士多德】
94《中国哲学简史》【冯友兰】
95《庄子今注今译上》【陈鼓应】
96《庄子今注今译中》【陈鼓应】
97《庄子今注今译下》【陈鼓应】
98《资本论》【卡尔马克思】
99《自杀论（西方学术经典精装版）》【埃米尔迪尔凯姆】
', CURRENT_TIMESTAMP, CURRENT_TIMESTAMP, 4, NULL),
('其实摄影很简单[呲牙]只需要记熟景深、光圈、焦距、快门、光比、大逆光、小逆光、前45度光、135度光、反光板、营造光、平光、侧光、七分人像、三分人像、全身照、俯拍、仰拍、感光度、光比、离机闪、引导线、兴趣点、主体、陪体、黄金分割、对角线、剪影、高光溢出、直方图、鳄鱼光、小清新、特写、鱼眼镜头、抓拍、摆拍、肢体语言、合影照、顶光、眼影、三角光、K值、拍摄模式、反光板预升、快门线、三脚架、画质、锐度、ISO 、半按快门、测光锁定、CCD、 白加黑减、黑白灰、亮度值、光学变焦、数码变焦、全画幅、135胶片、柔光、散射光、硬光、伽马线、DX画幅、APS-C画幅、APS-H画幅、防抖、大平光、LR、PS、LB、RAW、ACR、曝光模式、对焦点、快门优先、光圈优先、AF-S超音波马达镜头、 镜头口径比、B快门、C-PL镜、高速同步闪光、鬼影、内对焦、前帘同步、后帘同步、 TTL、分区曝光、接片、糖水片、透视度、色相、饱和度、黑反转、HSB模式、RGB三原色模式、CMYK模式、JPEG、热靴、慢门、跟踪、色阶、曲线、高感、噪点、虚化、锐化、视角、机位、景深、后脱焦就很容易拍出一张图片啦。', CURRENT_TIMESTAMP, CURRENT_TIMESTAMP, 4, NULL),
('你要记得千万不要看月亮
为什么？
傻瓜，月光打在你脸上的时候，应该是滚烫的，因为混进了我的目光
我发现你好会撩啊

我在人海茫茫的城市里~悄悄想起了你~期待着再次与你相遇~只不过所有约定都被时间抹去~而我只剩下一颗守候的心~

要知道，阅历这种东西，它杀掉了幼稚，也误伤了纯真
所以还是赚钱最靠谱
所以求姻缘的菩萨看都不看，财神殿里长跪不起
没错
但也还是相当一个伟大的人
伟大的人什么意思？
傻瓜，在你沉迷对方眼睛的那一刻，才觉出自己的伟大，早于世界很久，发现最亮的星辰～', CURRENT_TIMESTAMP, CURRENT_TIMESTAMP, 2, NULL),
('一个向东一个向西
即使这样
也停止不了我对你的在意
我只会用自己的方式悄悄爱你
不管最后能否走在一起', CURRENT_TIMESTAMP, CURRENT_TIMESTAMP, 2, NULL),
('如果我的一生见过雪，踏过浪也牵过爱人的手，我就变成一颗松果，变成半只贝壳，变成挣扎的心脏，于是我就不盼望春天，不赞美海底，蹦蹦跳跳，下一秒就死去，永远沉溺于失去前的最后一秒，我践踏着浪漫走向永眠走向岸边，我丰富而慷慨，帮助人们获得爱又把自己关进冬天，等另一个自己出现', CURRENT_TIMESTAMP, CURRENT_TIMESTAMP, 2, NULL),
('高铁是朝九晚五的奔波，火车是人间烟火的相逢。', CURRENT_TIMESTAMP, CURRENT_TIMESTAMP, 2, NULL),
('在你爱他的时候，陪他度过了你的一段人生
在别人看重感情长度的时候，更重视感情的浓度
你如果他的城市，看过他的月亮，吃过他爱的美食，见过他在意的亲人
这又何尝不是经历过他这一生呢
要知道，没能陪伴他并不是你的错
在各自不在的时候变成更好的自己其实也是挺好的', CURRENT_TIMESTAMP, CURRENT_TIMESTAMP, 2, NULL),
('画画的人爱看云，写字的人爱赏雨，我呢，心里藏的都是你，因为你就是一朵雨做的云！
', CURRENT_TIMESTAMP, CURRENT_TIMESTAMP, 2, NULL),
('1.分享日常本就是件快乐的事，能得到回应自然就快乐加倍。
2.对与错在大部分的时候可真是个伪命题。老鼠吃人类的大米，人类管这叫偷食；人类偷了蜜蜂的蜂蜜，却夸蜜蜂勤劳。
3.十七岁没能送你花，二十七岁请你喝酒吧。
4.你总是那么忙，在这座城市里来回流淌，你甚至都没空悲伤，更谈不上制定方向。跑吧，跑吧，水击千里扶摇直上。', CURRENT_TIMESTAMP, CURRENT_TIMESTAMP, 2, NULL),
('看到一半知道这故事结尾了。即见过高山，走到海边才知道原来海更适合，可人住山里能避风遮雨，漂流海上有乘风破浪。到底山好还是海好，不可说尽矣。苍茫尘世你我不是唯一的选择，也不是最好的选择。难得糊涂，糊涂一世又有几人懂。', CURRENT_TIMESTAMP, CURRENT_TIMESTAMP, 2, NULL),
('“秋天有晚来迟暮的霞光 正如晚来的你皆是笑意”', CURRENT_TIMESTAMP, CURRENT_TIMESTAMP, 2, NULL),
('观古知今思进退，读书养志识春秋，“早于世界很久，发现最亮的星辰”。既不知进退，也不识春秋。求姻缘的菩萨看都不看，财神殿里长跪不起。你知道的我这一生都是个坚定不移的唯物主义者', CURRENT_TIMESTAMP, CURRENT_TIMESTAMP, 2, NULL),
('跌跌撞撞几度难关，轰轰烈烈，难把往事断，你来我往，推杯换盏，好似人间盛宴。', CURRENT_TIMESTAMP, CURRENT_TIMESTAMP, 2, NULL),
('情书

这封情书，每次读到都想掉眼泪。
这个曾想和我私奔的姑娘，已经嫁给了别人，当上了母亲。
我欠她一辈子。
------------------------------------------------------------------------------
我曾经想过跟你私奔，于是在地图上挑选了几个城市，厦门是第一个跳入脑海里的选择，符合一个想要私奔的人的理想居所----海边，清新，文艺加上可以找到稳定且不错的收入。
但是转念一想我又担心你觉得庸俗，我更担心海边的风浪会卷走你对我的爱意，于是，我又开始寻找，我挑了几个城市，并列上选择的理由和不尽如人意的地方。
昆明，我喜欢那儿的阳光和远离中土的喧嚣，云南菜倒是蛮符合我的品味不知道对你如何，但是那儿治安看起来不好，城里的小青年品味让人堪忧。
长沙，我没去过但是听说那儿生活惬意夜晚热闹，可我担心常年吃辣会对肠胃不好，且我听不懂那里人说的话，也不喜欢湖南卫视的主持人们。
成都，同样也是生活悠闲，同样也是辣的城市，我喜欢那儿，但是又担心气候，我知道你怕热怕出汗怕地震。
我也曾想过北方的小城，比如青岛和大连，但我受够了那里的寒冷，或者你觉得是不是我们可以去拉萨和南疆，但是亲爱的，我想跟你生活在一起，而不是片刻的停下再出发。

我算过我们的积蓄，可以买个大点的房子，不一定要新盖的，哪怕老旧一点或者偏远一些。因为我想你可能需要一个工作室，在你找不到工作的时候，你可能需要画图或者卖字来维持我们的生活。或者我也可以去找个朝九晚五的工作，但你知道我更爱每天做一道永不重复的菜来喂饱你。
我 希望墙和屋顶都是白色的，雪一样的洁白，那样搭配原木色的家具比较美。家具我们也不需要很多，一张床一个衣柜一个书桌还有几把椅子，水曲柳的材质或者干脆 从旧货市场找一些老式但保养良好的，我们拆了自己打造。我不介意学习如何做个木匠，但是刨花这种活儿亲爱的还是你来吧。
床单要水洗棉的，看着舒服，书桌前要永远有一束白色的栀子花。
地板上要铺一个厚厚的毯子，最好产自伊斯坦布尔，但我也知道尼泊尔那儿有一些相对廉价的货色。不然就长绒毛的跟大地一样的颜色，我们可以在白雪皑皑的冬天躺在上面看落地窗外面的雪。如果是夏天那就粗麻地毯，我们看云，就看上一整天。
院子里种什么好呢，我说一定要种些香草可以做菜的，还要一些蔬菜和鲜花。我想要一棵苹果树一棵桃树还要一棵樱花树，还想要一条狗和一只猫常年趴在墙角晒太阳。
我们有满满一墙的书，你会要我不要一直买下去了，而我会故意不听。每个午后，我们会在书房找个角落各自看书，直到天色渐沉，夜幕降临。

你知道么，这些其实我也可以都不要，只要和你生活在一起，在一个不用繁华的城市。当然我们无法选择更小的城市，因为我们并没有可以傍身的手艺，同时我也希望你可以过的舒服一些。
我可以坐几站地的公交接你下班，听你同事夸我温柔美貌，我们手拉手穿过公园学校，再在靠近家附近的摊位买上一两种你爱的食物。
我们不为职称奔忙，我们也不要发财升官，如果可以有一家店支撑每月的饮食生活，那就开一家店，随便一家店。
我们哪儿也不去，我们谁也不找，这样，谁也就不会走着走着就把谁丢掉了。

我再也不需要漂亮衣服了，我只要棉质的麻织的，最简单的款式，最纯色的T恤。我会把头发挽起，我会从此素颜，只要你还喜欢这样的一张脸。

春暖花开，风和日丽，窗前白色的幔帏随风飘荡，你写了一首诗给我，写了一封情书给我，你唱我爱的那首歌，我在旁边用钢琴帮你伴奏。
我们共同完成一幅画作，却要你构思画稿和勾勒，我只管填色。
我们在夏天时候去海边，在冬日寒冷的夜晚相拥入眠。
就这样，日复一日年复一年，直到死亡那一天的到来。

我想，我已经想象了所有的一切，却唯独忘了问你，要不要跟我一起走。', CURRENT_TIMESTAMP, CURRENT_TIMESTAMP, 3, NULL),
('人生分为三个阶段：
1：看山是山，看水是水
2：看山不是山，看水不是水
3：看山还是山，看水还是水
人年轻的时候喜欢向别人传播自己的思想，希望有更多的人认可自己，来体现自己的价值，同时也会去迎合别人的思想，来增加自己的社交因子，以获得更多的所谓友谊，你相信朋友，相信父母，相信社会的论调，对待所有事物都是那样直接与单纯，充满探索的味道————这是第一阶段。
当人成熟一些之后，经历了感情与社会的磨合，对各种事物有了自己“看似独到”的见解，认为过去自己在无谓的事物上浪费了很多精力，开始收缩社交圈子以及寻找真我，对自己“究竟想要什么”这个论点进行心理博弈，以图心灵和肉体上的纯净，让自己活得“看似洒脱”一些，外在表现是相对更加沉默了，做任何事目标性与目的性会强一些————这是第二阶段。【也就是题主问题里男生所处的一个阶段】
经过半生的红尘挣扎，这场问心旅途貌似到达了终点，但究竟是路走完了还是生命快结束了才误以为是终点还犹未可知，此时你发现那些形形色色的事物其实始终如一，变化的只有你而已，你明白了你追寻一生的东西依然是年轻时那些看似幼稚的事物，你明白了失去的东西才是最美好的，因此开始懂得珍惜当下，爱惜自己拥有的一切，你开始变得固执，不愿改变，不愿再随时代的浪涛漂流，你变成了一颗被湍流摩擦的有些闪亮的鹅卵石，坚定又固执的躺在一个角落，看着一块块小石子“被”激流勇进，你或不屑或温和的对待他们，仿佛面对曾经的自己————这就是第三阶段。
一切都没有改变，改变一切的是人心。
只要不违法，尽情开心就好，祝各位人道圆满。', CURRENT_TIMESTAMP, CURRENT_TIMESTAMP, 2, NULL),
('一个人最了不起的地方，不在于他是否抵达了终点，而在于他是否超越了命运本身的局限', CURRENT_TIMESTAMP, CURRENT_TIMESTAMP, 2, NULL),
('糖果
刚才打电话也不知道我说了半天那种意思说明白了没有，我以前也谈过恋爱，所以挺能理解你们现在的这种情况的。你们在一起不长时间？3个月左右？其实很多的情侣在3个月左右会出现那种所谓的厌倦心理，原因无非就是慢慢的没了刚开始的那种感觉，对方会慢慢暴露出自己的问题，就拿你说的他吼你，我相信不仅是你，很多女孩在找男朋友的时候都不会想着以后找个会吼自己的男朋友吧。我听完你说的之后我其实有很多想说，但又没有说出口。两个人在一起其实真的没必要这么累。与其这个样子还不如早点解脱，你说你等他提分手，你不妨睡不着的时候想一想，这个样子吃亏的到底是你还是他。我并不是说在这里瞎扯淡，我不会因为他是男生我也是男生我就偏袒他向着他说话。就事论事，如果这种情况发生在我身边，我绝对看不下去。女孩本来就是要男生去宠的。无论他到底多么烦躁，都不应该吼你，说那些令你伤心的话，这样一点都不负责任，一点都没有尽到自己的本分。哪怕是真的特别忙，我忙完以后一定找机会会好好解释清楚，而不是应付了事。我特别烦的时候就很少找朋友聊天，我觉得朋友是跟你分享快乐的人，而不是分享你痛苦的人。这样不好。不是说他在夜店工作就说他不好，只是酒吧夜店那种场所各种形形色色的人都有，都接触，至少我不会跟整体混迹酒吧的人深交做朋友，我怕不懂他们，进而浪费自己的心思时间去经营一段在他看来无所谓的友谊。
还有，咱聊了那么长时间，也算半个朋友了，我觉得你也挺通情达理，挺懂事的，真的，我很少见有你这种想法的女孩，最起码我周围的女孩很少这么认真对待感情的。其实你没必要在他背后为他去做些什么，他不领情你干嘛还要这么大费周折呢？这么累为什么还坚持呢？你应该也会明白就是，只有势均力敌的感情才稳定，这种求别人而获得的感情很卑微，真正适合的两个人是不用追求很久。深情且多情的是男人，长情且绝情的是女人。女人忠诚的是爱情本身，而不是人，所以女人开启了新的恋情之后，对前任不会太多愧疚和眷恋。因为在她们看来，我只要忠于目前的这段恋情感情就好。至于这个人是谁不重要。而男人呢，忠诚的是人，而非爱情。过往之人慢慢跨越，俗尘之事一一拒绝。车内坐等乘客赏月，车外夜里挑灯看雪。
突然想起来之前看到有人发这个挺真实的：
说谈恋爱的人每天都在干嘛？
吃了没、早点睡、多穿点、喝热水、没电了、刚开机、刚才一直在想你
这个东西有点贵、今天开了一天会、忙了一天我很累、那个女孩是我妹
你别闹、真没有、只是一起喝点酒、喝多了、乱说的、我们只是好朋友
你干嘛、对不起、我也不知错哪里、你很好、我不配、忘了我吧下一位。

是不是跟你现在的情况很相似？

这种肯定是属于不合适的那种。合适的人不是说天天尬聊，机械地说着早安晚安，而是生活的琐事会分享给彼此，不用太感动，重要的不是事情本身，而是分享给她时的那种喜悦。
别的我也不好多说，解铃还需系铃人，你们俩的事情还得你们解决，至于你还要不要跟他继续，其实你的心里有答案。
多读书，提升自己，在大学中总没错。气质认知上去了，每天接触的朋友也就自然而然的发生变化，感情方面最起码可以找到一个能理解自己的人吧
加油', CURRENT_TIMESTAMP, CURRENT_TIMESTAMP, 2, NULL),
('知不知道在心理学上把那些就是
上车后习惯性地看向窗外的人分为哪两种类型
一类大概就是 善于观察的人
喜欢大自然，热爱生活
 这类人可以放心去交朋友，一般都是充满爱心、善心的
另一类人大概就是容易多愁善感的人
虽然说很多时候他们不怎么善于言辞
但内心还是比较细腻，丰富的
放心我只会对你说，你头发乱了
傻瓜，如果我爱你，而你正巧也爱我
你头发乱了，那我会笑笑的替你拨一拨头发
然后手指留恋在你发上多待几秒
如果我爱你，而你不巧的不爱我
你头发乱了，我会轻轻的告诉你
你发头乱了， 出自村上春树

和你普及一个撩妹撩汉的小知识
和女生相处的要义就是
若她涉世未深，你就带她看尽人间繁华
若她心已沧桑，你就带她去坐旋转木马
和男生相处的要义就是
若他情窦初开，你就宽衣解带
若他阅人无数，你就灶边炉台

他只字未提我爱你，你却句句都是我愿意
他却明明什么都没做，你却在脑海里演了千万出戏
你迷路了多久了
人与人交往多半肤浅
或者说在肤浅这个层面上
 交往才是容易的
一旦对方走进深处
人与人就是互相的迷宫咯

年轻时爱上什么都不为过
成熟时放弃什么也都可以理解

那你为什么还坚持呢
你应该也会明白就是
只有势均力敌的感情才稳定
这种求别人而获得的感情很卑微
真正适合的两个人是不用追求很久
 
我跟你讲下我看到的挺有意思的一点
我想你应该喜欢上了一座冰山
如果他人品什么的是如你所想、所见
那很替你开心的一点就是
当你成功融化了他之后
你可以很放心
因为他现在对你的态度
便是他日后对其他异性的态度

莫言

本性善良的人都晚熟，並且他們是被劣人所催熟的。當別人聰明伶俐時，他們又呆又傻；當別人權衡利弊時，他們一片赤誠；當別人心機用盡，他們靈魂開竅。後來雖然開竅了，但內心還是會保持善良和赤誠。他們不斷尋找同類，卻變成了最孤獨的那一個

——莫言《晚熟的人》 ', CURRENT_TIMESTAMP, CURRENT_TIMESTAMP, 2, NULL),
('当你的品味越小众，意味着你欣赏的事物，情感，艺术越不随波逐流，你对自己的认识越深刻，和你产生共鸣的人就越少，和人群的距离自然而然越拉越远。孤独感是在所难免的，但你会欣然接受它，因为属于你的气质正在形成，你对自己的兴趣了解越多，对大众的喜好保持尊敬，生活质量越高孤独还是问题么。', CURRENT_TIMESTAMP, CURRENT_TIMESTAMP, 2, NULL),
('生命中的黄金时间，是在当下还是在未来？

生命的黄金时间，我认为是在当下。
在正式聊这个话题之前，我想先和大家分享，时间对我来说，究竟意味着什么。
谈及时间，你会想到什么？手表，日历，相对论，亦或是褪色的那张老照片？我们不缺乏度量时间的工具，但每个人对于时间的认知有所不同。于我而言，时间是经验的累积，是宝贵的礼物。
时间对每个人而言，我认为是相对公平的，如果没有意外，从出生到死亡，手中掌握的时间基本是公平的。而人的一生总有起伏，不太会有人终生顺遂心意，面临诸多的人生考验时，如果“心态正确”，随着岁月增加，则会变成一种“累计”，日积月累的智慧与经验都会让人变得更加“丰慧”，这是很吸引人的部分。
刚提到的状况存在一个假设前提——“心态正确”。很多人面对时间的流逝，会存有恐慌焦虑的心态，我也不例外，譬如说，害怕身体的衰老，惧怕面部的第一道皱纹，逐渐松垮的肉体⋯等，但我后来发现，我不该害怕每一条皱纹的出现，而应该去追求每个肌肤当下紧实、饱满的状态，因为我明白了，真正会让我焦虑的，不是年龄的增长，而是当我老了，还没有找到会令我真心快乐的事情，还没有努力的去实践它。
而当自己能想清楚后，我越发明白，时间并不可怕，它能帮助我不断成长，去达成我想做的事，时间甚至可以说是一种礼物。只要每个当下，我努力去学习，去改变，甚至勇敢地面对错误，每一个当下都能够累积成最后的成功。也甚至，每一个当下都是将来回首时最好的回忆，只要我们尽了力。
英文Present 除了有礼物这一层含义，另一层意义便是“当下”。借由这个字跟大家分享，我认为活在当下，便是把握了人生的礼物。未来不可预知，当下是唯一能掌握的，有什么理由错失当下的每一分每一秒呢？因此，生命的黄金时间，在当下。
“活在当下”恐怕是诸多人的座右铭之一，然而细想，真正身体力行者仍是少数。很多人总是把希望寄予在明天，就好比说，每当你想跑步的时候，借口天气不佳、时间太忙，明明从产生跑步的念头开始，至少可以跑半小时，躺在床上刷手机不知不觉过了一个又一个半小时，眼睁睁看着时间流逝，最终什么也没完成。村上春树曾经说过“今天不想跑，所以才去跑。”当你犹豫是否要跑步的时候，就立刻穿上跑鞋去跑步，当你犹豫完的时候，其实你已经跑完了。所以我认为，现在你不会做的事，将来你也不会做，千万不要把梦想，计划放在明天！
当然，把握当下，不代表每一个当下都是最成功跟顺利的，我曾经光跑三公里就气喘吁吁，并不是“天赋型选手”。二零一一年给自己立了一个小目标，九十天内参加旧金山半程马拉松。从开始的三公里、八公里、十公里、再到二十一公里，一步步实现三个月“征战”半马的目标。开始跑步时，因为是过敏体质，流汗还会导致自己起疹子，过程实在痛苦万分，常跑到一半因为身体疲惫不堪，也曾经怀疑自己怎么可能撑完二十一公里。后来教练和我分享一件事，他说：“如果你把目标放在二十一公里远，你会觉得自己永远跑不到终点，但是当你把目标放到三步远的距离，每一次踏实的往前跑一步，方向正确，你一定可以跑完二十一公里。”于是我听从教练的话慢慢练习，不好高骛远，只把目标放在前三步，踏实的踩好每一步。慢慢地，我发现我可以多跑一圈、十公里、十五公里，我逐渐相信自己可以完成半马，并且明白，只有愈发相信当下的每一步，不断坚持累计，才能实现目标。其实，人生的目标就如同长跑，当下的累计，才能收获未来的硕果。每当你犹豫不决，瞻前顾后，或者目标设得太远太不切实际，没准你就先错失或者放弃了最好的时机。
如何活在当下？首先得坚持你的目标，不再为拖延找借口，一旦立下目标，那就大胆去做，去坚持，我一直觉得人生苦短，即便不成功，但努力过了，自己虽会留下遗憾，但至少不会给自己后悔的机会。
不论是否相信宗教轮回，人到世间短短数十载，就算有来世也不会记得曾经发生过什么，而人世间很大，因此我总想要在这一生中尽自己所能去体验、去认识这个世界。而表演、运动、旅行、摄影和阅读都是我认识自己，认识这个世界的媒介。我很幸运，能坚持并且从事我自己所喜欢的事情。也因为这样，我总是很享受每个我生命中的当下，当然包括好的与不好的。曾经有个易经老师跟我分享过一句话，我很喜欢，他说：“如果没有吃过苦，当你吃到甜食的时候就不会加倍地觉得甜入心，人生也是一样的，遇到苦难的时候，如果能够好好的充实自己，将来开出的花朵，就会更加的美丽！”是的，当我明白这一点的时候，就越能接受人生不如意的时候。也开始相信，凡事都有最好的安排，只要在自己的能力范围内突破舒适区，活在当下，踏实一点，把当下的事情做好就可以了。
当然我也曾陷入迷茫与焦虑，不论是对年龄抑或是事业的焦虑。三十岁之前，惴惴不安，因表现不达预期懊恼不已，而真正当三十岁如期而至时，反倒坦然释怀。那是因为我借由公益活动，再次找寻到了内心的声音，我发现我人生的快乐与否、内心是否平静，与我的年龄和外表一点关系都没有！只要我不断活在当下，往对的方向努力，时间反而会让我成为一个更顺心自在，无畏无惧的人。
于是，三十岁后，我从想要做好表演，在表演过程中尝试学会克服紧张、自卑、害羞，到学会打开内在，享受表演带来的成就感。我很幸运，找到了人生中热爱的事情，让它成为了我的事业而非职业。除此之外，我依旧保留喜欢在清晨时分，以跑步的方式和熟悉的、陌生的城市说“早上好”！偶尔还能与朋友在晨间街头相遇，这样的习惯一坚持便是十多年。看着跑步记录器上的数字持续累积，特别踏实！阅读，更是让我在有限的时间、空间里，去知道古今中外的种种故事、去打开各种没有限制的想像力与可能性，让我对这个世界更加好奇！这几年我还尝试了许多新鲜的事物，比如学跳伞，中医、气功、红酒⋯对我来说人生就像是一场电动，除了破关之外，中间的过程才是最重要的，一定要让自己玩得快乐、玩得过瘾、玩得不虚此行！这些对我来说，便是“当下”的魅力所在。活在当下，不畏变老，每个瞬间都可以是生命的黄金时间。
我想这就是我心中的“金砖人生”吧。
托马斯·曼在《浮士德博士》中有这么一段话：
Do you believe love is the strongest emotion?
Do you know any stronger?
Yes, interest.
寻找并坚持真正喜欢的兴趣，在生命的长河里，活在当下，每个瞬间都能成为黄金时间。To be stronger.
不畏变老，时间是礼物！随着成长，每道皱纹都是最好的装扮。迈过三十岁后，工作、运动、阅读、学习新事物，只要能做我真心喜欢的事，都是我活在当下的方式，就如同金砖人生，鼓励着我们活出真我、活出精彩，让我们看起来金光熠熠。', CURRENT_TIMESTAMP, CURRENT_TIMESTAMP, 2, NULL),
('Are U Java?, because without you, I am just a script.

Are U https?, because without you, I am just a ://.', CURRENT_TIMESTAMP, CURRENT_TIMESTAMP, 2, NULL);
-- ('', CURRENT_TIMESTAMP, CURRENT_TIMESTAMP, 2, NULL),
-- ('', CURRENT_TIMESTAMP, CURRENT_TIMESTAMP, 2, NULL),
-- ('', CURRENT_TIMESTAMP, CURRENT_TIMESTAMP, 4, NULL);