-- Your SQL goes here
INSERT INTO public.posts ("content", "created_at", "updated_at", "user_id", "reply_to") VALUES
('三个数字入门：1-2-6
1：所有的茶都来源于同样一种茶树。不同的茶类来自不同的茶树这是误解，并没有绿茶树和红茶树的区别。
2：在山茶科山茶属茶组的近 20茶类植物中，通常只有茶种（俗称“小叶种”，因为耐寒，种植面积广泛）和阿萨姆种（俗称“大叶种”，原始品种，只分布在偏热地区）两个品种。
6：六大茶类：绿茶、白茶、黄茶、青茶、红茶、黑茶。

一颗茶树的鲜叶可以制成任何一种茶，不同茶叶的颜色和口味是由不同工艺产生。制茶讲究看茶制茶，就是根据想要的品质特征来选取相应的茶，并不是越稀缺越好、越嫩越好。一杯茶的风味由品种、风土、工艺、冲泡来决定，不需要乱七八糟的故弄玄虚的法事。

中国茶命名规则：
地名+茶：如六堡茶、龙井茶、普洱茶；
名称+外形：如黄山毛峰、君山银针；
地名+品类；如滇红、福鼎白茶；
茶树栽培品种直接命名：如大红袍、鸭屎香；
特殊：如安吉白茶（实际是绿茶，因为研制品种是白化品种，故称白茶）。

六大品类：1979年，茶学家陈椽正式提出。将茶分六大类。区分依据：干茶颜色、品质和制法的系统性。六大茶类分法 2023 年从中国的分类体系上升为 ISO 世界标准。

如同不少常识一样，是因为一些人的懒惰和另一些人的别有用心而造成了信息差。由此推荐下 YouTube 上一席的这期分享，可以简单明了地了解基本茶学知识。上述总结正是来源于此：

https://youtu.be/bvKp7KoCPWU?si=KD98_Gr48kpz8tiE', CURRENT_TIMESTAMP, CURRENT_TIMESTAMP, 1, NULL),
('男生只需布局三年，就没人敢瞧不起你

一、每天布局

1、每天坚持早睡早起。坚持6:00起床，22:30分左右睡觉。坚持每天唤醒你的不是闹钟，而是梦想。

2、每天坚持看书二小时，没有时间也要挤出时间去看，随身携带一本书、坐公交、地铁的时候也可以看几页。

读书，要多读一流的好书，站在巨人的肩膀上去看世界。

3、每天日程坚持守时。凡事提前10分钟，重要会议提前二十分钟。写好当日计划，知行合一。

4、每天坚持运动，顶置健康能力。
每天摄入8粒红枣10粒枸杞，再来2~3公里慢跑或快走，保持身体活力四射。

5、每天坚持出门前，面对镜子微笑。头发要姿整，皮鞋要油亮，腰杠要挺直，胡子不要走中间路线，人要有精神气。每天走路，走的是虎步。

二、每周布局

1、每周去一次图书馆，博览群书，提高思想和技能，最充分地去适应时代。

2、每星期去见一个你想见的人，可以请比你优秀的人单独吃饭，也可以和志趣相投的人在一起，提升能量。

3、每星期登山一次，会当凌绝顶，一览众山小。登山感悟自然，与生命对话，与命运和解

4、每周花半天时间，写一篇有深度的文章;或观看一部一流的记录片，再写一篇读后感。保持思想输出。

5、每周和父母见一次面，家人闲坐，灯火可亲，就是握着一份稳稳的幸福。

如果路途遥远，那么至少每星期给父母打一次电话，维持亲情，靠近亲情，因为人到了一定的年纪后，你就会发现，除了家人，你已几乎一无所有。

三、每月布局

1、每月存一次钱，哪怕是少少的3000~5000元，也要坚持每月固定存钱，顶置储蓄能力。
银行卡里的余额，才是你生活的底气。

2、每月去做一件“无用”但开心的事。如到陌生的地方旅行，或参加马拉松比赛，“无用”即大用。

3、每月考察调研一次，研究趋势，捕捉机会，发现商机。

4、每月做一次义工，向他人付出爱，积福积徳。做人施比受有福。

5、每月断舍离一次。不需要的东西，扔掉;负能量的朋友，扔掉。

四，每年布局

1、每年做一次战略布局。选择比努力重要，不要用战术上的勤奋去掩饰战略上的懒惰。

2、每年自己体检一次，带家人体检一次。关注健康，听从营养医生的建议，调整生活方式和饮食习惯，养成更好更合适的生活规律。

3、学会藏富。每年做一次稳健的投资，让财富产生裂变，增加睡后收入。

4、每年出国一次，去感受不同的文化，去见识世界不同的面。

5、每年回老家一次，寻根祭祖，饮水思源，回到故土，审视自己的灵魂，注入生命新的能力，不忘初心，重新出发。', CURRENT_TIMESTAMP, CURRENT_TIMESTAMP, 1, NULL),
('偷偷告诉你一些，“人性潜规则”

1.别人发来信息，不要秒回，秒回会显得无所事事。

2.在别人家，如果他的另一半，躲在房间里不出来，说明不欢迎你，找个理由，赶紧走。

3.去亲戚家里，尽量选择住宾馆，你换位思考一下就知道。

4.红事不请不去，白事不请自来。

5.微信里给你发“在嘛”，一般是有事求你，不是借钱，就是有棘手的事。

6.别人让你看他的手机时，不要乱点、乱滑动，每个人都有自己的秘密不想被你发现。

7.带“吧”字的话一定要反着听，比如:“留下来一起吃饭吧”，这时候就要找理由离开了。

8.亲戚开的店，可以少去，但不能一次都不去。

9.刚刚参加过白事，就不要去别人家串门，别人会嫌弃。

10.去朋友家做客，再好的朋友，也要带点礼物，哪怕是几斤水果，因为你不带礼物，朋友不会介意，但他家人会介意。

11.朋友亲戚家孩子再不对，自己也不去教育，因为教育别人家的孩子，就是在打别人的脸。

12.男人出差回家，最好提前打个电话给老婆。

13.不谈论不在场的人，你说出多少秘密，就有多少危险，在等着你。

14.去外地出差，不要联系本地的同学，要理解大家都很忙，你联系了，别人就得招待你。

15.一个人去异性同事的办公室，记得把门打开。

16.去亲戚朋友家做客，回到家以后记得报一个平安。

17.别人倒茶给你喝时，就算不渴也要喝一点，这叫尊重。

18.份子钱一定要重视，份子钱的多少直接决定朋友的感情深浅。

19.喝了酒，不要送异性回家。

20.坐朋友的车，下车后，关门尽量轻一点，不然你会被朋友莫名的讨厌。

21.别人请客，不带朋友，客不带客是规矩。

22.出门聚会时，记得提前10分钟到，宁愿等的久，不要别人等，久而久之你就会被信任。

23.求人办事，带上一个大家都熟悉的朋友，这样成功率会很高。

24.长期招工的公司，千万不要去，待遇一定不怎么样。

25.出去出吃饭时，人家夹菜不要转桌，看到人家敬酒，要懂得放下筷子。

26.半路遇到的酒局，别人再热情也不要去。

27.人老了，不要跟孩子走的太近，各过各的日子，可以避免很多矛盾。

28.晚上8点以后尽量不打电话给别人，有事就发微信。

29.别人夫妻吵架找到你，你就算觉得别人再不合适，也要劝和不劝分，因为别人一旦和好，你就是被远离的那一个人。

30.叫别人买东西，一定要先给钱，多退少补。

31.同居越久，越难结婚。

32.不管你信不信，女人醉酒，抽烟，纹身，都会被别人看轻。

33.女人只要经济不独立，在家庭中做的再好，也会被男人嫌弃。

34.如果你不想和某人聊天，但又不想得罪他，就把回信息的时间拉长。

35.对待亲戚，少装富，多哭穷；对待朋友
害人之心不可有，防人之心不可无。

36.劝你大度的人，大多没安好心。

37.教你赚钱的人，多数都是想赚你钱。

38.别人来和你说公道话，就已经说明他不站在你的立场来说话。

39.免费的产品，最后都是想把你变成产品。

40.不要指望别人，会为自己雪中送炭，没有人在你脸上抹炭，就要谢天谢地了。', CURRENT_TIMESTAMP, CURRENT_TIMESTAMP, 1, NULL),
('运动+早睡+戒糖+防晒+多喝水，你就比90%的人美了
2、糖是万恶之源，比辣还可怕，糖化和光老化是皮肤衰老的两大元凶
3、一年四季都要防晒，抗衰老就是从防晒开始的
4、多运动可以提高新陈代谢，帮助肌肤排毒
5、每天保证充足睡眠，比任何护肤品和保健品都管用
6、保持好心情，避免肝火旺盛造成内分泌失调，多喝水，可以促进新陈代谢
8、不要侧睡，不仅会压迫身体器官，还会加重皱纹和法令纹
9、不要用手挤痘痘，有感染的风险，还容易留下痘印
10、定期清洗化妆工具，避免细菌的产生', CURRENT_TIMESTAMP, CURRENT_TIMESTAMP, 1, NULL),
('Content of post 5', CURRENT_TIMESTAMP, CURRENT_TIMESTAMP, 1, NULL),
('Content of post 6', CURRENT_TIMESTAMP, CURRENT_TIMESTAMP, 1, NULL),
('Content of post 7', CURRENT_TIMESTAMP, CURRENT_TIMESTAMP, 2, NULL),
('Content of post 8', CURRENT_TIMESTAMP, CURRENT_TIMESTAMP, 2, NULL),
('Content of post 9', CURRENT_TIMESTAMP, CURRENT_TIMESTAMP, 1, NULL),
('Content of post 10', CURRENT_TIMESTAMP, CURRENT_TIMESTAMP, 1, NULL);
